export const nameRules = [
  (v) => !!v || "Ім'я та прізвище обов'язкові",
  (v) => /^[a-zA-Zа-яА-Я\s]+$/.test(v) || "Тільки літери дозволені в імені",
];

export const emailRules = [
  (v) => !!v || "Email обов'язковий",
  (v) => /.+@.+\..+/.test(v) || "Email повинен мати вигляд: example@gmail.com ",
];

export const passwordRules = [
  (v) => !!v || "Пароль обовязковий",
  (v) => v.length >= 8 || "Пароль повинен бути більше ніж 8 символів",
  (v) =>
    /[A-Z]/.test(v) || "Пароль повинен містити принаймні одну велику літеру",
  (v) => /[a-z]/.test(v) || "Пароль повинен містити принаймні одну малу літеру",
  (v) => /[0-9]/.test(v) || "Пароль повинен містити принаймні одну цифру",
  (v) =>
    /[\W_]/.test(v) ||
    "Пароль повинен містити принаймні один спеціальний символ",
];

export const confirmPasswordRules = (password) => [
  (v) => !!v || "Підвердіть пароль",
  (v) => v === password || "Паролі не співпадають",
];
